# SQL for Beginners ðŸ’»

By Justin Barry <br/>
https://watsontechworld.com

Welcome to SQL for Beginners. SQL is a wonderful language in my opinion. It is one of the biggest languages in the world, and is a language designed specifically for tabular databases; that is, databases that use tables, like spreadsheets do.

In [1]:
# Note I might use this book as the basis for a course

<strong>Note about different database systems:</strong><br/>
Different database systems such as MySQL / MariaDB, PostgreSQL, SQLite have some subtle differences in how they are implemented. I will try to show you SQL code that will work in all of the systems. This book will use MySQL / MariaDB, but with a little editing, you should be able to use it in PostgreSQL, SQLite, or almost any other database system that uses SQL

# Why even learn SQL? Why not just use Microsoft Excel, Google Sheets, LibreOffice Calc, or some other spreadsheet software?

This is a good question. In a nutshell, here are some top benefits of using SQL instead of a spreadsheet:
* SQL scales far better for large datasets. For example, you can go from dozens of rows to millions of rows without needing to change much
* SQL offers great optimizations
* SQL can be used with other programming languages such as Python, JavaScript, and almost any other modern programming language
* SQL allows you to build modern apps and websites
* Learning SQL will allow you to learn backend web development and full stack web development

# What are some top softwares that use SQL?

* WordPress (which uses MySQL by default)

# Database definition?????

## Get definition

This book is not meant to be a complicated computer science book on the theory of databases. In a nutshell, a database is just a collection of data. You could even consider a library with many books as a database. A database is a collection of information. But specifically with a computer, ?????????

# SQL vs Spreadsheets. Which to use?

There is no cut and dried answer. But generally, spreadsheets are good if you have a few hundred to a few thousand rows, based on my own experience. But once you get past 100,000 rows, SQL generally becomes a far better use case

# Spreadsheet benefits
* probably easier to use for very easy tracking, such as tracking exercise or spending for a small number of rows
* Spreadsheet softwares may have a lower learning curve

# Data is data. How you should view or use it depends on the situation. You can sometimes interchangably go between SQL databases and spreadsheets

And actually, sometimes you'll use both. I often will import data from a CSV file and then insert that data into a database. Or I do a search for something in a database, and then output that to a CSV file.

# SQL benefits
* Far more powerful than spreadsheet softwares
* Scales far better
* Can be more powerful
* Can be far faster than a spreadsheet
* Allows you to interact with a database interactively

# Selecting or retrieving data from a databases

Selecting or retrieving data is done with the `SELECT` keyword

<strong>-- 1. Show all data from salary table</strong><br/>
`select * from salary;`

<strong>-- 2. select name, gender, career, age, yearly_salary from salary table and sort by age</strong><br/>
`SELECT name, gender, career, age, yearly_salary FROM salary ORDER BY age;`

<strong>-- 3. Do similarly, but instead sort by yearly salary ascending</strong><br/>
`SELECT name, gender, career, age, yearly_salary FROM salary ORDER BY yearly_salary;`

<strong>-- 4. Now do similarly, but instead sort by yearly salary descending</strong><br/>
`SELECT name, gender, career, age, yearly_salary FROM salary ORDER BY yearly_salary DESC;`

<strong>-- 5. Now do similarly, but instead sort by gender ascending and then yearly_salary descending</strong><br/>
`SELECT name, gender, career, age, yearly_salary FROM salary ORDER BY gender, yearly_salary DESC;`

<strong>-- 1. Show all data from salary table</strong><br/>
`select * from salary;`

Might give you output like the following:

+--------+------------------------------+---------------+--------+------+-----------+<br/>
| name   | career                       | yearly_salary | gender | age  | age_group |<br/>
+--------+------------------------------+---------------+--------+------+-----------+<br/>
| Brad   | doctor                       |        150000 | m      |   35 | 30-39     |<br/>
| Sana   | idol / singer                |       1450000 | f      |   28 | 20-29     |<br/>
| Luke   | data analyst                 |         80000 | m      |   39 | 30-39     |<br/>
| Tony   | teacher                      |         45000 | m      |   42 | 40-49     |<br/>
| Mike   | account clerk                |         44630 | m      |   25 | 20-29     |<br/>
| Leia   | chemical engineer            |        112000 | f      |   45 | 40-49     |<br/>
| Nick   | CEO                          |        250000 | m      |   57 | 50-59     |<br/>
| Cheryl | software engineering intern  |         68000 | f      |   23 | 20-29     |<br/>
| Wayne  | author                       |         75000 | m      |   75 | 70-79     |<br/>
| Julie  | author                       |         80000 | f      |   40 | 40-49     |<br/>
| John   | pizza delivery driver        |         30000 | m      |   37 | 30-39     |<br/>
| Jean   | waitress                     |         30000 | f      |   27 | 20-29     |<br/>
| Sonja  | professor                    |        150000 | f      |   45 | 40-49     |<br/>
| Sarah  | Uber driver                  |         40000 | f      |   38 | 30-39     |<br/>
| Mary   | lawyer                       |        300000 | f      |   33 | 30-39     |<br/>
| Olivia | day trader                   |         80000 | f      |   65 | 60-69     |<br/>
| Pilar  | entrepreneur / self-employed |         55000 | m      |   47 | 40-49     |<br/>
+--------+------------------------------+---------------+--------+------+-----------+<br/>
17 rows in set (0.01 sec)<br/>

# YouTube videos I've made on SQL

In [ ]:
# note to self. Use redirects instead of direct YouTube links for long term stability of the links.

SQL SELECT Statement Tutorial<br/>
https://youtu.be/iN8JMOtTG5E

SQL GROUP BY: Visual Guide & Examples<br/>
https://youtu.be/Fud1Rfsl9dE

SQL ORDER BY: Tutorial for Beginners<br/>
https://youtu.be/VKRnf60WZuo

SQL LIMIT: Quick Tutorial<br/>
https://youtu.be/64YKfHVbBiE

# INSERTING data

# DELETING data

# JOINs between 2 or more tables

# INSERT INTO

# SELECT

In [ ]:
This will retreivew.

# GROUP BY

In [ ]:
This will put data into groups or buckets and then do aggregate functions.

# ORDER BY

In [ ]:
This will order by 1 or more columns

# SQL LIMIT

The `LIMIT` keyword will restrict the number of rows that can appear in the output.<br/>
For example, if you said:<br/>
`SELECT * FROM salary LIMIT 5;`<br/>
above would give a maximum of 5 rows (it would be 0 - 5 rows) thought.

```-- watsontechworld.com

-- show databases;

use teaching_db;

show tables;

-- 1a. Show all data from salary table
select * from salary;

-- 2a. Show all data from salary table but limit to 5 rows
select * from salary LIMIT 5;

-- 3a. select name, gender, career, age, yearly_salary from salary table and sort by age
SELECT name, gender, career, age, yearly_salary FROM salary ORDER BY age;

-- 4a. select name, gender, career, age, yearly_salary from salary table and sort by age and limit to 10 rows
SELECT name, gender, career, age, yearly_salary 
FROM salary
ORDER BY age
LIMIT 10;

-- 5a. select name, gender, career, age, yearly_salary from salary table and sort by yearly salary descending
SELECT name, gender, career, age, yearly_salary
FROM salary
ORDER BY yearly_salary DESC;

-- 6a. select name, gender, career, age, yearly_salary from salary table and sort by yearly salary descending and limit to 7 rows
SELECT name, gender, career, age, yearly_salary
FROM salary
ORDER BY yearly_salary DESC
LIMIT 7;


-- Using star database
--  HYG Database
-- https://www.astronexus.com/projects/hyg

-- columns
-- proper_star_name, parsecs_from_earth, light_years_from_earth, constellation_full_name, apparent_magnitude
-- proper_star_name - Full name of a star, if it exists (many stars have no proper name).
-- parsecs_from_earth - distance from earth in parsecs from earth
-- light_years_from_earth (converting from parsecs. 1 parsec = roughly 3.26156 light years)
-- constellation_full_name - full constellation name. The original data just has abbreviations.
-- apparent_magnitude - Apparent magnitude (brightness as seen from Earth). The smaller the value the larger the brightness as seen from Earth.

-- 1b. Show all data from star_data table. Don't limit the number of rows in MySQL Workbench
select * from star_data;

-- 2b. Show how many rows in star_data table (there are over 100,000 rows)
select COUNT(*) from star_data;

-- 3b. Note how adding limit N for N >=1 to above will not change the number of rows;
select COUNT(*) from star_data LIMIT 5;

-- 4b. Show all data from star_data table but limit to 100 rows
select * from star_data LIMIT 100;

-- 5b. Select proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude from star_data (keeping all data)
SELECT proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude FROM star_data;

-- 6b. Select proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude from star_data but limit to 100 rows
SELECT proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude FROM star_data LIMIT 100;

-- 7b. Select proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude from star_data
-- and sort by light_years_from_earth ascending
SELECT proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude
FROM star_data
ORDER BY light_years_from_earth ASC;

-- 8b. Select proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude from star_data
-- and sort by light_years_from_earth ascending and also limit to 100 rows
SELECT proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude
FROM star_data
ORDER BY light_years_from_earth ASC
LIMIT 100;


-- 9b. Select proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude from star_data
-- and make sure it must have a proper star name (it can't be NULL)
-- sort by light_years_from_earth ascending.
SELECT proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude
FROM star_data
WHERE proper_star_name IS NOT NULL
ORDER BY light_years_from_earth ASC;

-- 10b. Select proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude from star_data
-- and make sure it must have a proper star name (it can't be NULL)
-- sort by light_years_from_earth ascending
-- and limit it to 100 rows
SELECT proper_star_name, light_years_from_earth, constellation_full_name, apparent_magnitude
FROM star_data
WHERE proper_star_name IS NOT NULL
ORDER BY light_years_from_earth ASC
LIMIT 100;



-- 11b.  select constellation_full_name, average light years from earth grouped by constellation_full_name sorted by average light years from earth
-- and make sure constellation name is not null
SELECT constellation_full_name, AVG(light_years_from_earth)
FROM star_data
WHERE constellation_full_name IS NOT NULL
GROUP BY constellation_full_name
ORDER BY AVG(light_years_from_earth);

-- 12b.  select constellation_full_name, average light years from earth grouped by constellation_full_name sorted by average light years from earth
-- and make sure constellation name is not null and limit to 50 rows
SELECT constellation_full_name, AVG(light_years_from_earth)
FROM star_data
WHERE constellation_full_name IS NOT NULL
GROUP BY constellation_full_name
ORDER BY AVG(light_years_from_earth)
LIMIT 50;```

# Appendix

# MySQL Commands

## showing databases

`show databases`

You might see something like this:

show databases; <br/>
+--------------------+<br/>
| Database           |<br/>
+--------------------+<br/>
| information_schema |<br/>
| mysql              |<br/>
| performance_schema |<br/>
| sys                |<br/>
| teaching_db        |<br/>
| wordpress_db       |<br/>
+--------------------+<br/>
6 rows in set (0.01 sec)<br/>

# Select or get into a specific database

`use some_database_name`

Let's say you want to use the teaching_db database. To start using that, in MySQL, you would type something like the following:

`use teaching_db`

You might see something like this:

Reading table information for completion of table and column names<br/>
You can turn off this feature to get a quicker startup with -A<br/>
<br/>
Database changed

# Showing tables in a database

To show all the tables in a database, once a database has been selected, you can use a similar command like the following:

`show tables;`

You might see something like:

show tables;<br/>
+-----------------------+<br/>
| Tables_in_teaching_db |<br/>
+-----------------------+<br/>
| salary                |<br/>
| star_data             |<br/>
+-----------------------+<br/>
2 rows in set (0.01 sec)

# Note on capitalization of keywords in SQL

Technically, keywords such as `SELECT`, `ORDER BY`, `GROUP BY`, `FROM`, and other SQL keywords actually don't need to be capitalized, and the system usually won't care if you do. But, it is good practice because:
* It can make it easier to quickly see SQL keywords